Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/third_party/nxp/devices/mimxrt1189/drivers/fsl_rgpio.h
/*
 * Copyright (c) 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2017, 2020-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef FSL_RGPIO_H_
#define FSL_RGPIO_H_

#include "fsl_common.h"

/*!
 * @addtogroup rgpio
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*@{*/
/*! @brief RGPIO driver version 2.1.0. */
#define FSL_RGPIO_DRIVER_VERSION (MAKE_VERSION(2, 1, 0))
/*@}*/

/*! @brief RGPIO direction definition */
typedef enum _rgpio_pin_direction
{
    kRGPIO_DigitalInput  = 0U, /*!< Set current pin as digital input*/
    kRGPIO_DigitalOutput = 1U, /*!< Set current pin as digital output*/
} rgpio_pin_direction_t;

#if defined(FSL_FEATURE_RGPIO_HAS_ATTRIBUTE_CHECKER) && FSL_FEATURE_RGPIO_HAS_ATTRIBUTE_CHECKER
/*! @brief RGPIO checker attribute */
typedef enum _rgpio_checker_attribute
{
    kRGPIO_UsernonsecureRWUsersecureRWPrivilegedsecureRW =
        0x00U, /*!< User nonsecure:Read+Write; User Secure:Read+Write; Privileged Secure:Read+Write */
    kRGPIO_UsernonsecureRUsersecureRWPrivilegedsecureRW =
        0x01U, /*!< User nonsecure:Read;       User Secure:Read+Write; Privileged Secure:Read+Write */
    kRGPIO_UsernonsecureNUsersecureRWPrivilegedsecureRW =
        0x02U, /*!< User nonsecure:None;       User Secure:Read+Write; Privileged Secure:Read+Write */
    kRGPIO_UsernonsecureRUsersecureRPrivilegedsecureRW =
        0x03U, /*!< User nonsecure:Read;       User Secure:Read;       Privileged Secure:Read+Write */
    kRGPIO_UsernonsecureNUsersecureRPrivilegedsecureRW =
        0x04U, /*!< User nonsecure:None;       User Secure:Read;       Privileged Secure:Read+Write */
    kRGPIO_UsernonsecureNUsersecureNPrivilegedsecureRW =
        0x05U, /*!< User nonsecure:None;       User Secure:None;       Privileged Secure:Read+Write */
    kRGPIO_UsernonsecureNUsersecureNPrivilegedsecureR =
        0x06U, /*!< User nonsecure:None;       User Secure:None;       Privileged Secure:Read */
    kRGPIO_UsernonsecureNUsersecureNPrivilegedsecureN =
        0x07U, /*!< User nonsecure:None;       User Secure:None;       Privileged Secure:None */
    kRGPIO_IgnoreAttributeCheck = 0x80U, /*!< Ignores the attribute check */
} rgpio_checker_attribute_t;
#endif

#if defined(FSL_FEATURE_RGPIO_HAS_IRQ_CONFIG) && FSL_FEATURE_RGPIO_HAS_IRQ_CONFIG
/*! @brief Configures the interrupt generation condition. */
typedef enum _rgpio_interrupt_sel
{
    kRGPIO_InterruptOutput0 = 0x0U, /*!< Interrupt/DMA request/trigger output 0. */
    kRGPIO_InterruptOutput1 = 0x1U, /*!< Interrupt/DMA request/trigger output 1. */
    kRGPIO_InterruptOutput2 = 0x2U, /*!< Interrupt/DMA request/trigger output 2. */
    kRGPIO_InterruptOutput3 = 0x3U, /*!< Interrupt/DMA request/trigger output 3. */
} rgpio_interrupt_sel_t;

/*! @brief Configures the interrupt generation condition. */
typedef enum _rgpio_interrupt_config
{
    kRGPIO_InterruptOrDMADisabled        = 0x0U,  /*!< Interrupt/DMA request is disabled. */
    kRGPIO_DMARisingEdge                 = 0x1U,  /*!< DMA request on rising edge. */
    kRGPIO_DMAFallingEdge                = 0x2U,  /*!< DMA request on falling edge. */
    kRGPIO_DMAEitherEdge                 = 0x3U,  /*!< DMA request on either edge. */
    kRGPIO_FlagRisingEdge                = 0x05U, /*!< Flag sets on rising edge. */
    kRGPIO_FlagFallingEdge               = 0x06U, /*!< Flag sets on falling edge. */
    kRGPIO_FlagEitherEdge                = 0x07U, /*!< Flag sets on either edge. */
    kRGPIO_InterruptLogicZero            = 0x8U,  /*!< Interrupt when logic zero. */
    kRGPIO_InterruptRisingEdge           = 0x9U,  /*!< Interrupt on rising edge. */
    kRGPIO_InterruptFallingEdge          = 0xAU,  /*!< Interrupt on falling edge. */
    kRGPIO_InterruptEitherEdge           = 0xBU,  /*!< Interrupt on either edge. */
    kRGPIO_InterruptLogicOne             = 0xCU,  /*!< Interrupt when logic one. */
    kRGPIO_ActiveHighTriggerOutputEnable = 0xDU,  /*!< Enable active high-trigger output. */
    kRGPIO_ActiveLowTriggerOutputEnable  = 0xEU,  /*!< Enable active low-trigger output. */
} rgpio_interrupt_config_t;
#endif

/*!
 * @brief The RGPIO pin configuration structure.
 *
 * Each pin can only be configured as either an output pin or an input pin at a time.
 * If configured as an input pin, leave the outputConfig unused.
 * Note that in some use cases, the corresponding port property should be configured in advance
 *        with the PORT_SetPinConfig().
 */
typedef struct _rgpio_pin_config
{
    rgpio_pin_direction_t pinDirection; /*!< RGPIO direction, input or output */
    /* Output configurations; ignore if configured as an input pin */
    uint8_t outputLogic; /*!< Set a default output logic, which has no use in input */
} rgpio_pin_config_t;

/*! @} */

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @addtogroup rgpio_driver
 * @{
 */

/*! @name RGPIO Configuration */
/*@{*/

/*!
 * @brief Initializes a RGPIO pin used by the board.
 *
 * To initialize the RGPIO, define a pin configuration, as either input or output, in the user file.
 * Then, call the RGPIO_PinInit() function.
 *
 * This is an example to define an input pin or an output pin configuration.
 * @code
 *  Define a digital input pin configuration,
 * rgpio_pin_config_t config =
 * {
 *   kRGPIO_DigitalInput,
 *   0,
 * }
 * Define a digital output pin configuration,
 * rgpio_pin_config_t config =
 * {
 *   kRGPIO_DigitalOutput,
 *   0,
 * }
 * @endcode
 *
 * @param base   RGPIO peripheral base pointer (RGPIOA, RGPIOB, RGPIOC, and so on.)
 * @param pin    RGPIO port pin number
 * @param config RGPIO pin configuration pointer
 */
void RGPIO_PinInit(RGPIO_Type *base, uint32_t pin, const rgpio_pin_config_t *config);

/*!
 * @brief Gets the RGPIO instance according to the RGPIO base
 *
 * @param base    RGPIO peripheral base pointer(PTA, PTB, PTC, etc.)
 * @retval RGPIO instance
 */
uint32_t RGPIO_GetInstance(RGPIO_Type *base);
/*@}*/

