Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/third_party/nxp/devices/mimxrt1189/drivers/fsl_rgpio.h
/*! @name RGPIO Output Operations */
/*@{*/

/*!
 * @brief Sets the output level of the multiple RGPIO pins to the logic 1 or 0.
 *
 * @param base    RGPIO peripheral base pointer (RGPIOA, RGPIOB, RGPIOC, and so on.)
 * @param pin     RGPIO pin number
 * @param output  RGPIO pin output logic level.
 *        - 0: corresponding pin output low-logic level.
 *        - 1: corresponding pin output high-logic level.
 */
static inline void RGPIO_PinWrite(RGPIO_Type *base, uint32_t pin, uint8_t output)
{
    if (output == 0U)
    {
        base->PCOR = 1UL << pin;
    }
    else
    {
        base->PSOR = 1UL << pin;
    }
}

/*!
 * @brief Sets the output level of the multiple RGPIO pins to the logic 1 or 0.
 * @deprecated Do not use this function.  It has been superceded by @ref RGPIO_PinWrite.
 */
static inline void RGPIO_WritePinOutput(RGPIO_Type *base, uint32_t pin, uint8_t output)
{
    RGPIO_PinWrite(base, pin, output);
}

/*!
 * @brief Sets the output level of the multiple RGPIO pins to the logic 1.
 *
 * @param base RGPIO peripheral base pointer (RGPIOA, RGPIOB, RGPIOC, and so on.)
 * @param mask RGPIO pin number macro
 */
static inline void RGPIO_PortSet(RGPIO_Type *base, uint32_t mask)
{
    base->PSOR = mask;
}

/*!
 * @brief Sets the output level of the multiple RGPIO pins to the logic 1.
 * @deprecated Do not use this function.  It has been superceded by @ref RGPIO_PortSet.
 */
static inline void RGPIO_SetPinsOutput(RGPIO_Type *base, uint32_t mask)
{
    RGPIO_PortSet(base, mask);
}

/*!
 * @brief Sets the output level of the multiple RGPIO pins to the logic 0.
 *
 * @param base RGPIO peripheral base pointer (RGPIOA, RGPIOB, RGPIOC, and so on.)
 * @param mask RGPIO pin number macro
 */
static inline void RGPIO_PortClear(RGPIO_Type *base, uint32_t mask)
{
    base->PCOR = mask;
}

/*!
 * @brief Sets the output level of the multiple RGPIO pins to the logic 0.
 * @deprecated Do not use this function.  It has been superceded by @ref RGPIO_PortClear.
 *
 * @param base RGPIO peripheral base pointer (RGPIOA, RGPIOB, RGPIOC, and so on.)
 * @param mask RGPIO pin number macro
 */
static inline void RGPIO_ClearPinsOutput(RGPIO_Type *base, uint32_t mask)
{
    RGPIO_PortClear(base, mask);
}

/*!
 * @brief Reverses the current output logic of the multiple RGPIO pins.
 *
 * @param base RGPIO peripheral base pointer (RGPIOA, RGPIOB, RGPIOC, and so on.)
 * @param mask RGPIO pin number macro
 */
static inline void RGPIO_PortToggle(RGPIO_Type *base, uint32_t mask)
{
    base->PTOR = mask;
}

/*!
 * @brief Reverses the current output logic of the multiple RGPIO pins.
 * @deprecated Do not use this function.  It has been superceded by @ref RGPIO_PortToggle.
 */
static inline void RGPIO_TogglePinsOutput(RGPIO_Type *base, uint32_t mask)
{
    RGPIO_PortToggle(base, mask);
}
/*@}*/

/*! @name RGPIO Input Operations */
/*@{*/

/*!
 * @brief Reads the current input value of the RGPIO port.
 *
 * @param base RGPIO peripheral base pointer (RGPIOA, RGPIOB, RGPIOC, and so on.)
 * @param pin     RGPIO pin number
 * @retval RGPIO port input value
 *        - 0: corresponding pin input low-logic level.
 *        - 1: corresponding pin input high-logic level.
 */
static inline uint32_t RGPIO_PinRead(RGPIO_Type *base, uint32_t pin)
{
    return (((base->PDIR) >> pin) & 0x01U);
}

/*!
 * @brief Reads the current input value of the RGPIO port.
 * @deprecated Do not use this function.  It has been superceded by @ref RGPIO_PinRead.
 */
static inline uint32_t RGPIO_ReadPinInput(RGPIO_Type *base, uint32_t pin)
{
    return RGPIO_PinRead(base, pin);
}

#if defined(FSL_FEATURE_RGPIO_HAS_PORT_INPUT_DISABLE) && FSL_FEATURE_RGPIO_HAS_PORT_INPUT_DISABLE
/*!
 * @param base   RGPIO peripheral base pointer (RGPIOA, RGPIOB, RGPIOC, and so on.)
 * @param mask   RGPIO pin number mask
 * @param enable RGPIO digital input enable/disable flag.
 */
static inline void RGPIO_EnablePortInput(RGPIO_Type *base, uint32_t mask, bool enable)
{
    if (enable)
    {
        base->PIDR &= ~mask;
    }
    else
    {
        base->PIDR |= mask;
    }
}
#endif

/*@}*/

#if defined(FSL_FEATURE_SOC_PORT_COUNT) && FSL_FEATURE_SOC_PORT_COUNT
/*! @name RGPIO Interrupt */
/*@{*/

/*!
 * @brief Reads the RGPIO port interrupt status flag.
 *
 * If a pin is configured to generate the DMA request, the corresponding flag
 * is cleared automatically at the completion of the requested DMA transfer.
 * Otherwise, the flag remains set until a logic one is written to that flag.
 * If configured for a level sensitive interrupt that remains asserted, the flag
 * is set again immediately.
 *
 * @param base RGPIO peripheral base pointer (RGPIOA, RGPIOB, RGPIOC, and so on.)
 * @retval The current RGPIO port interrupt status flag, for example, 0x00010001 means the
 *         pin 0 and 17 have the interrupt.
 */
uint32_t RGPIO_PortGetInterruptFlags(RGPIO_Type *base);

/*!
 * @brief Reads the RGPIO port interrupt status flag.
 * @deprecated Do not use this function.  It has been superceded by @ref RGPIO_PortGetInterruptFlags.
 */
static inline uint32_t RGPIO_GetPinsInterruptFlags(RGPIO_Type *base)
{
    return RGPIO_PortGetInterruptFlags(base);
}

/*!
 * @brief Clears multiple RGPIO pin interrupt status flags.
 *
 * @param base RGPIO peripheral base pointer (RGPIOA, RGPIOB, RGPIOC, and so on.)
 * @param mask RGPIO pin number macro
 */
void RGPIO_PortClearInterruptFlags(RGPIO_Type *base, uint32_t mask);

/*!
 * @brief Clears multiple RGPIO pin interrupt status flags.
 * @deprecated Do not use this function.  It has been superceded by @ref RGPIO_PortClearInterruptFlags.
 */
static inline void RGPIO_ClearPinsInterruptFlags(RGPIO_Type *base, uint32_t mask)
{
    RGPIO_PortClearInterruptFlags(base, mask);
}
#endif
#if defined(FSL_FEATURE_RGPIO_HAS_ATTRIBUTE_CHECKER) && FSL_FEATURE_RGPIO_HAS_ATTRIBUTE_CHECKER
/*!
 * @brief The RGPIO module supports a device-specific number of data ports, organized as 32-bit
 * words. Each 32-bit data port includes a GACR register, which defines the byte-level
 * attributes required for a successful access to the RGPIO programming model. The attribute controls for the 4 data
 * bytes in the GACR follow a standard little endian
 * data convention.
 *
 * @param base RGPIO peripheral base pointer (RGPIOA, RGPIOB, RGPIOC, and so on.)
 * @param mask RGPIO pin number macro
 */
void RGPIO_CheckAttributeBytes(RGPIO_Type *base, rgpio_checker_attribute_t attribute);
#endif

